docs/kernel-ci: use mermaid for flow chart
GitHub has support for fow charts in mermaid [0] and claud AI easily
assisted to create this for us [1]. All bow to the new overlords.

[0] https://docs.github.com/en/get-started/writing-on-github/working-with-advanced-formatting/creating-diagrams
[1] https://claude.site/artifacts/5987e018-b6d7-420e-bec3-5ed144fbe707

Signed-off-by: Luis Chamberlain <mcgrof@kernel.org>
